target/test-classes/xml/selfcare/modifysubscription/TC31927_createOrder

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <ord1:createOrder type="NEW" xsi:schemaLocation="http://order.telco.hsntech.com ShopFront.xsd" correlationId="" xmlns:ord1="http://order.telco.hsntech.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <account type="RESIDENTIAL">
                <contact type="BILLING" language="en_GB">
                    <title>Ms</title>
                    <firstName></firstName>
                    <lastName></lastName>
                    <telephoneNumbers defaultContact="daytime">
                        <daytime>0398403850</daytime>
                        <evening>0208619999</evening>
                        <mobile>02086999990</mobile>
                    </telephoneNumbers>
                    <emailAddress></emailAddress>
                    <birthDate>1975-04-22</birthDate>
                </contact>
                <billingAddress>
                    <buildingIdentifier>3</buildingIdentifier>
                    <addressLine1>DALTON WAY</addressLine1>
                    <addressLine2>Address Line 2</addressLine2>
                    <town>ELY</town>
                    <country>United Kingdom</country>
                    <postcode>CB61DS</postcode>
                    <ptc_abs_code>PTCABS22099025</ptc_abs_code>
                    <startDate>1980-08-08</startDate>
                </billingAddress>
                <accountDetail>
                    <username></username>
                    <password>Password10</password>
                    <securityQuestion>Name of first school?</securityQuestion>
                    <securityAnswer>Marysville</securityAnswer>
                </accountDetail>
                <billingDetail>
                    <billGroupId>422</billGroupId>
                    <preferredNotification>SMS</preferredNotification>
                    <paymentDetail type="CARD">
                        <creditCard>
                            <cardName>MasterCard Card Name</cardName>
                            <cardNumber>5573471234567898</cardNumber>
                            <cardType>MC</cardType>
                            <cardExpiryDate>0328</cardExpiryDate>
                            <cvv>123</cvv>
                        </creditCard>
                    </paymentDetail>
                    <billFormat>SUMMARY</billFormat>
                    <clubcardNumber>634579530205372710</clubcardNumber>
                </billingDetail>
            </account>
            <verification runCreditCheck="true" termsAndConditionsAccepted="true" refundableDepositAccepted="false" acceptAgreement="true">
                <interconnect>
                    <param name="PAYASYOUGO"/>
                </interconnect>
            </verification>
            <orderDetail orderRef="12345" ipAddress="160.206.234.22" salesChannel="Onlines" externalSystemID="COCO" devicePrint="DEVICEPRINT-AA" paymentMethod="CARD">
                <dateTime>2011-06-10T16:44:31.0Z</dateTime>
                <orderItem id="1" masterSubscription="true" dealSKU="DEAL-INHAND">
                    <serviceRef reference="Mobile FC 1"/>
                    <tariff productCode="FC12-1000-500SO">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </tariff>
                    <device productCode="HTC-DESIRE-XXX-99">
                        <deliveryMethod>DELIVER</deliveryMethod>
                        <imei>143219180932760</imei>
                        <serialNumber>123152436457768456784684</serialNumber>
                        <agreement provider="AGRTESCOMOBILE">
                            <number>43H1QuuZJ9</number>
                        </agreement>
                    </device>
                    <discBundle productCode="02000-SB-A" bundleGroup="SB-GRP-A" billCapNotifications="false">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </discBundle>
                </orderItem>
                <orderItem id="2" dealSKU="DEAL-INHAND">
                    <serviceRef reference="Mobile FC 2"/>
                    <tariff productCode="FC1-0750-150SO">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </tariff>
                    <device productCode="HTC-DESIRE-1MON">
                        <deliveryMethod>DELIVER</deliveryMethod>
                        <imei>143219180932760</imei>
                        <serialNumber>123152436457768456784684</serialNumber>
                        <agreement provider="AGRTESCOMOBILE">
                            <number>43H1QuuZJ9</number>
                        </agreement>
                    </device>
                    <discBundle productCode="02000-SB-A" bundleGroup="SB-GRP-A" billCapNotifications="false">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </discBundle>
                </orderItem>
                <orderItem id="3" dealSKU="DEAL-INHAND">
                    <serviceRef reference="Mobile FC 3"/>
                    <tariff productCode="FC12-1000-500SO">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </tariff>
                    <device productCode="NK-2720">
                        <deliveryMethod>DELIVER</deliveryMethod>
                    </device>
                    <discBundle productCode="02000-SB-A" bundleGroup="SB-GRP-A" billCapNotifications="false">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </discBundle>
                </orderItem>
                <orderItem id="4" dealSKU="DEAL-INHAND">
                    <serviceRef reference="Mobile FC 4"/>
                    <tariff productCode="FC12-1000-500SO">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </tariff>
                    <device productCode="HTC-DESIRE-XXX-99">
                        <deliveryMethod>DELIVER</deliveryMethod>
                        <imei>143219180932760</imei>
                        <serialNumber>123152436457768456784684</serialNumber>
                        <agreement provider="AGRTESCOMOBILE">
                            <number>43H1QuuZJ9</number>
                        </agreement>
                    </device>
                    <discBundle productCode="02000-SB-A" bundleGroup="SB-GRP-A" billCapNotifications="false">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </discBundle>
                </orderItem>
                <paymentRequest>
                    <cardName>MasterCard Card Name</cardName>
                    <cardNumber>5573471234567898</cardNumber>
                    <cardType>MC</cardType>
                    <cardExpiryDate>0328</cardExpiryDate>
                    <cvv>123</cvv>
                </paymentRequest>
            </orderDetail>
        </ord1:createOrder>
    </soapenv:Body>
</soapenv:Envelope>


